#include<stdio.h>
#include<string.h>

////移位操作符
// int main()
// {
//     int a = -2;   //反码存储 11111111 11111111 11111111 11111111 11111111 11111111 11111111 11111110
//     int b = a >> 1;  //右移1位 11111111 11111111 11111111 11111111 11111111 11111111 11111111 11111111 
//     //1、算术右移  -- 右边舍去，左边补符号位 （这里使用的是算术右移）
//     //2、逻辑右移  -- 右边舍去，左边补0
//     printf("%d\n",b);  //-1

//     int c = 5;  //反码存储 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000101
//     int d = c << 1;  //00000000 00000000 00000000 00000000 00000000 00000000 00000000 00001010
//     //左边丢弃，右边补0
//     printf("%d\n",d); //10
//     return 0;
// }

// //位操作符
// int main()
// {
//     // //按位与
//     // int a = 3;     //0...0011
//     // int b = -5;    //1...1011
//     // int c = a & b; //0...0011 -- 3
//     // printf("%d\n",c);//3

//     // //按位或
//     // int a = 3;     //0...0011
//     // int b = 5;     //0...0101
//     // int c = a | b; //0...0111 -- 7
//     // printf("%d\n", c); //7
     
//     //按位异或
//     int a = 3;    //0...0011
//     int b = 5;    //0...0101
//     int c = a ^ b;//0...0110 -- 6 相同为0，相异为1
//     printf("%d\n", c); //6
//     return 0;
// }

// //不创建变量交换两个数的值
// int main()
// {
//     int a = 3;
//     int b = 5;

// //     //加减法 --可能会溢出
// //     printf("a=%d b=%d\n",a,b);
// //     a = a + b;  //a==a+b
// //     b = a - b;  //a==a+b-b
// //     a = a - b;  //b==a+b-a
// //     printf("a=%d b=%d\n",a,b);

//     //异或的方法    
//     //原理 b^b==0  0^a==a
//     a = a ^ b;
//     b = a ^ b;  //a==0^a==(a^b)^b
//     a = a ^ b;  //b==0^b==(a^b)^a
//     printf("a=%d b=%d\n", a, b);
//     return 0;
// }

//统计num中补码的1的个数

//1、方法2
// int main()
// {
//     int num = 1;
//     int i = 0;
//     int j = 31;
//     // char s[33] ; //补码
//     // s[32] = 0;
//     char s[33] = {0}; //补码
//     char s1[64] = {0}; //反码
//     char s3[64] = {0}; //源码


//     int count = 0;
//     printf("请输入要统计的数字：");
//     scanf("%d", &num);
//     for (i = 0; i < 32;i++,j--)
//     {
//         if(1 == ((num >> i) & 1))
//         {
//             count++;
//             s[j] = '1';
//         }
//         else
//         {
//             s[j] = '0';
//         }
//     }
//     strcpy(s1, s);
//     strcpy(s3, s1);
//     if(num<0)
//     {
//         for (i = 31; i >= 0;i--)
//         {
//             //从最低位减一
//             if('0'==s1[i])  //最低位为0
//             {
//                 s1[i] = '2' - 1; //借位减一
//             }
//             else //最低位为1
//             {
//                 s1[i] -= 1; //直接减一
//                 break;
//             }
//         }
//         for (i = 1; i < 32;i++) //除符号位取反
//         {
//             s3[i] = !(s1[i]-'0')+'0';
//         }
//     }

//     printf("%d的补码为：%s\n", num, s);
//     printf("%d的反码为：%s\n", num, s1);
//     printf("%d的原码为：%s\n", num, s3);

//     printf("%d\n", count);
//     return 0;
// }

//2、方法2
int main()
{
    int num = 0;
    int count = 0;
    printf("请输入你要计算的数：");
    scanf("%d",&num);
    while(num)
    {
        count++;
        //从低位向高位一次减少一个1
        num = num & (num - 1);  //num-1向第一个1借位，第一个1变为0，&num目的是将后面因借位减法产生的1置为0
    }
    printf("%d\n", count);

    // printf("%d\n", sizeof(int*));
    // printf("%d\n", sizeof(char *));
    return 0;
}